## DNS
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                           NAME                            |
|--------|-----------------------------------------------------------|
| add    | `aws_route53_record.salesforce-dkim-SF2-cds-snc-ca-CNAME` |
|        | `aws_route53_record.salesforce-dkim-sfi-cds-snc-ca-CNAME` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_record.salesforce-dkim-SF2-cds-snc-ca-CNAME will be created
  + resource "aws_route53_record" "salesforce-dkim-SF2-cds-snc-ca-CNAME" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "sf2._domainkey.cds-snc.ca"
      + records         = [
          + "SF2.yu6fhb.custdkim.salesforce.com.",
        ]
      + ttl             = 1800
      + type            = "CNAME"
      + zone_id         = "Z35N8HLYUZDWBH"
    }

  # aws_route53_record.salesforce-dkim-sfi-cds-snc-ca-CNAME will be created
  + resource "aws_route53_record" "salesforce-dkim-sfi-cds-snc-ca-CNAME" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "sfi._domainkey.cds-snc.ca"
      + records         = [
          + "sfi.33h9xl.custdkim.salesforce.com.",
        ]
      + ttl             = 1800
      + type            = "CNAME"
      + zone_id         = "Z35N8HLYUZDWBH"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.Route53TerraformDeploy"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.notify_prod_dns_manager_policy"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.notify_prod_dns_manager"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_user.dns-github-deployer"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.alpha-canada-ca-public"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.cds-snc-ca-public"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.gcdigital-ca-public"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.platform-canada-ca-public"]

27 tests, 19 passed, 8 warnings, 0 failures, 0 exceptions

```

</details>
